
import random

__all__ = ["gen_random_nickname"]

__prefix =[
    "똑똑한", "용감한", "지혜로운", "창의적인", "호기심 많은", "결단력 있는", "사려 깊은", "열정적인", "현명한", 
    "친절한", "독창적인", "영리한", "성실한", "낙천적인", "근면한", "우아한", "재치 있는", "침착한", 
    "예술적인", "모험적인", "매력적인", "카리스마 있는", "통찰력 있는", "열린 마음의", "진취적인", 
    "도전적인", "독립적인", "유연한", "유머러스한", "배려 깊은", "신중한", "낭만적인", "성공적인", 
    "고요한", "대담한", "혁신적인", "지적인", "자유로운", "책임감 있는", "따뜻한", "열성적인",
    "앉아 있는", "달리는", "웃는", "생각하는", "고민하는", "기다리는", "이야기하는", "노래하는", "춤추는", 
    "공부하는", "읽는", "쓰는", "걷는", "뛰는", "그리는", "상상하는", "먹는", "마시는", "휴식하는", 
    "여행하는", "도전하는", "탐험하는", "찾아보는", "연구하는", "배우는", "일하는", "놀라는", "설명하는", 
    "연설하는", "비교하는", "계획하는", "감탄하는", "응원하는", "준비하는", "감사하는", "고백하는", 
    "성찰하는", "관찰하는", "애정하는", "응시하는", "고군분투하는", "도망가는", "협력하는", "포기하지 않는"
]

__famous_people = [
    # 철학자
    "소크라테스", "플라톤", "아리스토텔레스", "칸트", "헤겔", "니체", "루소", "데카르트", 
    "스피노자", "키르케고르", "공자", "맹자", "장자", "프로이트", "융", "스키너", "피아제", "매슬로우", 
    "제임스", "로저스", "비고츠키", "아들러", "왓슨", 
    "밀", "로크", "듀이", "아렌트", "홉스", "마르크스", 
    "몽테스키외", "바디우", "지젝", "푸코", "사르트르",
    "이이", "이황", "정약용", "정몽주", "한용운", 
    "신채호", "장영실", "허준", "세종대왕",
    # 과학자
    "아인슈타인", "뉴턴", "갈릴레오", "다윈", "테슬라", "마리퀴리", "파인만", "멘델", 
    "파스퇴르", "맥스웰", "플랑크", "케플러", "코페르니쿠스",
    
    # 평가 좋은 정치가
    "링컨", "간디", "넬슨만델라", "처칠", "프랭클린", "루스벨트", "샤를드골", "마틴루터킹",
    
    # 작가
    "셰익스피어", "톨스토이", "도스토예프스키", "해밍웨이", "오스카와일드", 
    "카프카", "조지오웰", "프루스트", "체호프", "버지니아울프", "제인오스틴",
    
    # 예술가
    "피카소", "고흐", "모네", "마티스", "고갱", "르누아르", "클림트", 
    "뭉크", "달리", "세잔", "브라크", "칸딘스키", "자코메티", 
    "르코르뷔지에", "고야", "렘브란트", "베르메르", "로댕", 
    "미켈란젤로", "라파엘로", "리베라", "키리코", "샤갈", 
    "호퍼", "워홀", "마그리트"
]


def gen_random_nickname() -> str:
    prefix = random.choice(__prefix)
    people_name = random.choice(__famous_people)
    ran_num = str(random.randint(1, 99999))
    
    return f"{prefix} {people_name} {ran_num}"